"""
    Дана строка, состоящая из слов, разделенных пробелами.
    Определите, сколько в ней слов.

Пример:
Тест 1
Входные данные:
Hello world

Вывод программы:
2



Тест 2
Входные данные:
Hello

Вывод программы:
1

"""

print(input().count(' ') + 1)
